wroscoe/dustycam-archive/cameras/xiaocam1/software/app/sdkconfig.defaults
# Seeed XIAO ESP32S3 Sense: 8 MB flash (DIO), 8 MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FATFS long file names (spool sidecar/jpg names are short 8.3-safe today,
# but the standard's layout keeps this on generally)
CONFIG_FATFS_LFN_HEAP=y

# Custom OTA-capable partition table (partitions.csv), two 3 MB app slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# OTA: rollback safety net + plain-HTTP fallback for LAN dev; the XIAO's
# real deployment uses SERVER_TLS (Funnel), cert bundle on.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# OTA download from app_main overflows the 3.5 KB default stack (sarg:
# esp-https-ota-main-task-stack-overflow-reboot-loop-bricks-ota).
# 12288 was not enough either (2026-09-16): the drain's first upload enters
# dusty_uplink_post_file() with 12 720 B of frames already on the stack
# (app_main 2608 + radio_window_run 608 + contact_run_contact 3776 +
# drain_tier 1312 + post_file 4336, from the ELF's `entry` instructions),
# before stat/fopen/DNS/TLS -- a silent overflow every contact that had
# files to drain (docs/phone_app_status.md "LIVE BUG").
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480

# esp_timer task: Wi-Fi's timer callbacks run here too; the default 3584 left
# little margin. dusty_ble's advertising-interval callback no longer does its
# NimBLE work on this task (it posts to the host task).
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# Light heap poisoning: head/tail canaries on every block (+8 B each), so
# heap_guard() (main/crashdbg.c) can catch an overrun at the next phase
# boundary instead of it surfacing later as an unrelated panic.
CONFIG_HEAP_POISONING_LIGHT=y

# The XIAO has no UART bridge; the console (and this project's
# software/host/monitor.py) is USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Deep-sleep wake cycle: don't let the watchdog fire across a long
# contact/drain, and keep tick resolution fine enough for LED patterns.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000

# ============================================================
# docs/phone_app_plan.md §3 P1: dusty_ble (NimBLE) SRAM diet, copied
# verbatim from runtime/espidf/bench/ble_spike/sdkconfig.defaults
# (that file's own header explains why each of these values is set --
# every one of them was exercised and, where noted, corrected on real
# hardware during the P0 bench pass).
#
# Log level: WARN by default, the app's own tags re-enabled at INFO in
# app_main (esp_log_level_set). Bench 2026-09-15: with INFO for every tag,
# a USB-Serial-JTAG reader attached during Wi-Fi bring-up wedged the console
# and the hotspot join stalled until its 90 s timeout; with WARN (the bench
# spike's setting) the same join takes 1.7 s.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# ---- NimBLE peripheral only: no central/observer, no pairing (decision 5:
# HMAC challenge with an owner key instead of LE Secure Connections) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_MAX_CCCDS=4
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=16
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
# Explicit, not just "unset": IDF 5.5 defaults this to y once both BT and
# Wi-Fi are enabled, contrary to decision 9 ("sequential radios", never
# concurrent). Confirm off with: grep COEX_SW build/config/sdkconfig.h

# ---- Wi-Fi buffer trims (re-measured at XIAO gate 4, P1.4) ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- TLS: dynamic buffers on; SSL_IN_CONTENT_LEN stays at the IDF
# default (16384) until P1 verifies the Funnel endpoint honours a smaller
# max_fragment_length -- deliberately NOT overridden here. ----
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# (CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT depends on the above and already
# defaults to y; there is no CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT symbol
# in IDF 5.5.)

# ---- stacks / heap: only for tasks that never write flash (dusty_ble's
# image worker) ----
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
